Ran Plan for project: `frontend_amer_autoscale_aws` dir: `frontend/aws_autoscale` workspace: `amer`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.asg[0].aws_autoscaling_group.this[0] will be created
+ resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = 1
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "dm-asg-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Environment"
              + "propagate_at_launch" = "true"
              + "value"               = "prod"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "frontend-aws-autoscale"
            },
          + {
              + "key"                 = "Project"
              + "propagate_at_launch" = "true"
              + "value"               = "megasecret"
            },
          + {
              + "key"                 = "extra_tag1"
              + "propagate_at_launch" = "true"
              + "value"               = "dm extra_value1"
            },
          + {
              + "key"                 = "extra_tag2"
              + "propagate_at_launch" = "true"
              + "value"               = "dm extra_value2"
            },
        ]
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = [
          + "subnet-1235678",
          + "subnet-87654321",
        ]
      + wait_for_capacity_timeout = "0"
    }

  # module.asg[0].aws_launch_configuration.this[0] will be created
+ resource "aws_launch_configuration" "this" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = false
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0f72889960844fb97"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "dm-lc-"
      + placement_tenancy           = "default"
      + security_groups             = [
          + "sg-12345678",
        ]

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "/dev/xvdz"
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = 50
          + volume_type           = "gp2"
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = 50
          + volume_type           = "gp2"
        }
    }

  # module.asg[0].null_resource.tags_as_list_of_maps[0] will be created
+ resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "extra_tag1"
          + "propagate_at_launch" = "true"
          + "value"               = "dm extra_value1"
        }
    }

  # module.asg[0].null_resource.tags_as_list_of_maps[1] will be created
+ resource "null_resource" "tags_as_list_of_maps" {
      + id       = (known after apply)
      + triggers = {
          + "key"                 = "extra_tag2"
          + "propagate_at_launch" = "true"
          + "value"               = "dm extra_value2"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "dns_domain" but a value was
found in file "terraform.tfvars". To use this value, add a "variable" block to
the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "dns_name" but a value was
found in file "terraform.tfvars". To use this value, add a "variable" block to
the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale_aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Faws_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale_aws`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
